{
  "selectedTemplate": 2,
  "headings": {
    "skills": "",
    "projects": "",
    "awards": "Certifications"
  },
  "basics": {
    "name": "Martin Fracker, Jr.",
    "phone": "979-676-5680",
    "website": "Martinfrackerjr.com",
    "email": "martin.frackerjr@gmail.com",
    "location": {
      "address": "Houston, TX"
    }
  },
  "education": [
    {
      "location": "College Station, TX",
      "institution": "Texas A&M University",
      "startDate": "-",
      "endDate": "-",
      "studyType": "BS",
      "area": "Computer Science"
    }
  ],
  "work": [
    {
      "highlights": [
        "Angular, Sass, Typescript, Kendo",
        "Discuss and iterate on design and architecture of new features for a Mobile Pool Builder cross-platform application.",
        "Moved flash-based IP camera live streaming technology to WebRTC",
        "Refactor code and standardize UI design to improve user experience",
        "Work remotely and manage own work schedule"
      ],
      "company": "Pentair",
      "position": "Senior Web Developer",
      "location": "Houston, TX",
      "startDate": "Sept '20",
      "endDate": "Present"
    },
    {
      "highlights": [
	"Vue.js, Vuex, Quasar, Typescript, Stylus",
        "Turned the startup's \"stadium in-seat ordering app\" proof of concept into an iterable MVP",
        "Developed and maintained cross platform applications targeting iOS, Android, and the browser",
        "Greenfielded a suite of applications in Vue.js and Quasar to service several stadiums in order to improve the food/beverage ordering process for the fans",
        "Refactor applications into monorepo to facilitate easier code reuse between them",
        "Automate and oversee automated CI/CD processes for all software",
        "Interview prospective developers",
        "Work remotely and manage own work schedule",
        "Supervise all development efforts"
      ],
      "company": "sEATz",
      "position": "Lead Software Engineer",
      "location": "Houston, TX",
      "startDate": "Jul '19",
      "endDate": "Sept '20"
    },
    {
      "location": "College Station, TX",
      "position": "Web Developer",
      "website": "",
      "startDate": "Apr '16",
      "endDate": "Jul '19",
      "highlights": [
	"Vue.js, Nuxt, Vuex, Node.js, AWS, Angular, Javascript, Typescript, Socket.io",
        "Worked with several clients as a web developer",
        "Gather business requirements from customers and generate technical specifications from them",
        "Collaborate with team to iterate on process improvements",
        "Implement technical specifications using various modern web technologies",
        "Attend and coordinate Agile Scrum events"
      ],
      "company": "Improving Enterprises"
    }
  ],
  "skills": [
    {
      "name": "Frameworks",
      "level": "",
      "keywords": [
        "Vue.js",
        "Angular",
        "Node.js",
        "Socket.io",
        "Jasmine",
        "Mocha"
      ]
    },
    {
      "keywords": [
        "Javascript",
        "Typescript",
        "HTML",
        "CSS",
        "Less",
        "Sass"
      ],
      "name": "Languages"
    },
    {
      "keywords": [
        "Git",
        "Linux",
        "AWS",
        "Azure",
        "Jenkins",
        "Travis",
        "Docker",
        "Netlify",
        "Agile Methodologies"
      ],
      "name": "Other"
    }
  ],
  "projects": [
    {
      "keywords": [
        "Angular",
        "Sass",
        "Typescript",
        "Kendo"
      ],
      "name": "Mobile Pool Builder",
      "description": "Work remotely in a small team of senior web developers to maintain legacy code while also moving the product forward with new features. The product is a cross-platform application which pool builders can use to manage the people and processes involved in constructing a pool from start to finish."
    },
    {
      "keywords": [
        "Vue.js",
	"Vuex",
        "Quasar",
        "Typescript",
        "Stylus"
      ],
      "name": "sEATz",
      "description": "A suite of cross-platform applications that facilitate the sales and delivery of stadium food to fans. The apps are written in Vue.js and Quasar enabling each app to use its own code base and target iOS, Android, and the web browser simultaneously. As lead developer, was responsible for leading the development effort as well as automating and overseeing CI/CD processes for not only the apps but also the backend services.",
      "url": "Seatzapp.com"
    },
    {
      "keywords": [
        "Angular",
        "Typescript"
      ],
      "name": "IPSO Offshore",
      "description": "Contributed to the development of the front-end Angular application utilized by Anadarko Petroleum Company for the purposes of surveillance and optimization of the operations of its offshore assets. Helped the team see value in story pointing enabling the team to provide greater transparency in forecasting team velocity based on empirical data. Added automated process to maintain code-style guidelines promoting greater developer comfort."
    },
    {
      "keywords": [
        "Vue.js",
	"Vuex",
	"Nuxt",
	"Javascript",
        "Node.js"
      ],
      "name": "Ivo Sites",
      "description": "Spearheaded the development of three static websites for a customer to promote his brand as well as his new book, 'Love Based Culture.' Integrated with an in-house developed backend to manage the sites' content. Utilized the Nuxt.js Vue meta-framework to build each website rapidly, leveraging the skills of a UX designer to make the websites look beautiful. Hosted all three websites on Netlify to take advantage of all that it had to offer including automated Let's Encrypt and CI/CD.",
      "url": "ivo.com"
    },
    {
      "name": "Social Media Application",
      "description": "Worked with a customer which provides a social media platform to its clients to add features to and stabilize the platform. As a full-stack developer, worked with the MEAN stack as well as Docker and Elasticsearch. Besides adding new features, improved the development process by upgrading the backend from Node 5 to LTS Node 8, streamlining the docker workflow by speeding up the time it takes to start the containers, and dockerizing elasticsearch. Also played a significant role in upgrading from Elasticsearch 2.4 to 5.6.",
      "url": "",
      "keywords": [
        "Angular.js",
        "Node.js",
        "AWS",
	"Javascript",
        "Mocha",
        "Sass",
        "Pug"
      ]
    },
    {
      "keywords": [
        "Angular",
        "Typescript",
        "Sass"
      ],
      "name": "Well Execution Planner",
      "description": "Redesigned the UX, integrated a spotfire dashboard, and added new functionality for customer front-end Angular application. As a front-end developer, worked with Angular 5, Sass, Twitter Bootstrap, and Jenkins."
    },
    {
      "keywords": [
        "AngularJS",
        "Vue.js",
	"Less",
        "Jasmine"
      ],
      "name": "ARM Lenda",
      "description": "Worked in a cross-functional scrum team to develop a management operations web application for a company which provides risk management solutions for agribusiness. Within the first year in production, closed more than a half-billion dollars’ worth of loans. Spearheaded rewrite from Angular.js to Vue.js."
    }
  ],
  "awards": [
    {
      "title": "PSM I",
      "date": "Jul 2016",
      "awarder": "Scrum.org",
      "summary": "As a Professional Scrum Master, demonstrated a fundamental level of Scrum mastery."
    },
    {}
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "skills",
    "projects",
    "awards",
    "education"
  ]
}
